Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions Properties
The AnalysisResultPositions type exposes the following members.
Properties
Name | Description
aPositions
 The position types.
aPositionsX
 The X coordinates of the positions.
aPositionsY
 The Y coordinates of the positions.
aPositionsZ
 The Z coordinates of the positions.
nPositions
 The number of returned positions.
ObjectId
 The identifier of the object.
ObjectType
 The object type. In result query the only supported type is the physical member (the part).
Top
See Also
Reference
AnalysisResultPositions Class
Tekla.Structures.Analysis Namespace